jmeter.log
2019-06-15 10:07:21,378 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2019-06-15 10:07:21,395 INFO o.a.j.JMeter: Loading user properties from: /usr/local/Cellar/jmeter/5.0/libexec/bin/user.properties
2019-06-15 10:07:21,396 INFO o.a.j.JMeter: Loading system properties from: /usr/local/Cellar/jmeter/5.0/libexec/bin/system.properties
2019-06-15 10:07:21,400 INFO o.a.j.JMeter: Copyright (c) 1998-2018 The Apache Software Foundation
2019-06-15 10:07:21,400 INFO o.a.j.JMeter: Version 5.0 r1840935
2019-06-15 10:07:21,400 INFO o.a.j.JMeter: java.version=1.8.0_181
2019-06-15 10:07:21,400 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2019-06-15 10:07:21,400 INFO o.a.j.JMeter: os.name=Mac OS X
2019-06-15 10:07:21,400 INFO o.a.j.JMeter: os.arch=x86_64
2019-06-15 10:07:21,400 INFO o.a.j.JMeter: os.version=10.14.5
2019-06-15 10:07:21,400 INFO o.a.j.JMeter: file.encoding=UTF-8
2019-06-15 10:07:21,400 INFO o.a.j.JMeter: Max memory     =1073741824
2019-06-15 10:07:21,400 INFO o.a.j.JMeter: Available Processors =12
2019-06-15 10:07:21,403 INFO o.a.j.JMeter: Default Locale=English (EN)
2019-06-15 10:07:21,403 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2019-06-15 10:07:21,404 INFO o.a.j.JMeter: JMeterHome=/usr/local/Cellar/jmeter/5.0/libexec
2019-06-15 10:07:21,404 INFO o.a.j.JMeter: user.dir  =/Users/jahidul/IdeaProjects/B1901_JMeter
2019-06-15 10:07:21,404 INFO o.a.j.JMeter: PWD       =/Users/jahidul/IdeaProjects/B1901_JMeter
2019-06-15 10:07:21,405 INFO o.a.j.JMeter: IP: 192.168.1.190 Name: Mds-MacBook-Pro.fios-router.home FullName: mds-macbook-pro.fios-router.home
2019-06-15 10:07:21,406 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/Users/jahidul/IdeaProjects/B1901_JMeter/results'
2019-06-15 10:07:21,408 INFO o.a.j.s.FileServer: Default base='/Users/jahidul/IdeaProjects/B1901_JMeter'
2019-06-15 10:07:21,411 INFO o.a.j.s.FileServer: Set new base='/Users/jahidul/IdeaProjects/B1901_JMeter'
2019-06-15 10:07:21,512 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2019-06-15 10:07:21,528 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2019-06-15 10:07:21,532 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2019-06-15 10:07:21,537 INFO o.a.j.s.SaveService: Loading file: Jira.jmx
2019-06-15 10:07:21,574 INFO o.a.j.p.h.c.CacheManager: Will only cache the following methods: [GET]
2019-06-15 10:07:21,583 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-06-15 10:07:21,583 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-06-15 10:07:21,584 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-06-15 10:07:21,584 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-06-15 10:07:21,584 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2019-06-15 10:07:21,584 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2019-06-15 10:07:21,607 INFO o.a.j.JMeter: Creating summariser <summary>
2019-06-15 10:07:21,611 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2019-06-15 10:07:21,612 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: results.csv
2019-06-15 10:07:21,612 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /usr/local/Cellar/jmeter/5.0/libexec/bin/reportgenerator.properties
2019-06-15 10:07:21,612 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2019-06-15 10:07:21,616 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2019-06-15 10:07:21,618 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2019-06-15 10:07:21,618 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction : {} is empty, not APDEX per transaction customization
2019-06-15 10:07:21,619 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2019-06-15 10:07:21,619 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2019-06-15 10:07:21,619 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2019-06-15 10:07:21,619 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2019-06-15 10:07:21,619 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2019-06-15 10:07:21,619 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2019-06-15 10:07:21,623 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2019-06-15 10:07:21,623 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-06-15 10:07:21,623 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2019-06-15 10:07:21,623 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2019-06-15 10:07:21,623 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2019-06-15 10:07:21,624 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2019-06-15 10:07:21,624 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-06-15 10:07:21,624 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-06-15 10:07:21,624 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-06-15 10:07:21,624 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-06-15 10:07:21,625 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2019-06-15 10:07:21,625 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2019-06-15 10:07:21,625 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2019-06-15 10:07:21,629 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2019-06-15 10:07:21,630 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-06-15 10:07:21,630 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-06-15 10:07:21,634 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2019-06-15 10:07:21,634 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2019-06-15 10:07:21,902 INFO o.a.j.JMeter: Running test (1560607641902)
2019-06-15 10:07:21,931 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2019-06-15 10:07:21,932 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Thread Group.
2019-06-15 10:07:21,932 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2019-06-15 10:07:21,932 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=1 perThread=100.0 delayedStart=false
2019-06-15 10:07:21,942 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2019-06-15 10:07:21,942 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2019-06-15 10:07:22,161 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2019-06-15 10:07:22,162 INFO o.a.j.s.FileServer: Stored: /Users/jahidul/IdeaProjects/B1901_JMeter/JmeterData.csv
2019-06-15 10:07:22,178 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = Mds-MacBook-Pro.fios-router.home
2019-06-15 10:07:22,185 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2019-06-15 10:07:22,186 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2019-06-15 10:07:22,186 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2019-06-15 10:07:22,186 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2019-06-15 10:07:22,186 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2019-06-15 10:07:22,266 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-2
2019-06-15 10:07:22,350 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2019-06-15 10:07:22,350 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-2
2019-06-15 10:07:22,350 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2019-06-15 10:07:22,350 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-2
2019-06-15 10:07:22,366 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-3
2019-06-15 10:07:22,398 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-3
2019-06-15 10:07:22,398 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-3
2019-06-15 10:07:22,466 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-4
2019-06-15 10:07:22,494 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-4
2019-06-15 10:07:22,495 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-4
2019-06-15 10:07:22,566 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-5
2019-06-15 10:07:22,597 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-5
2019-06-15 10:07:22,597 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-5
2019-06-15 10:07:22,666 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-6
2019-06-15 10:07:22,697 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-6
2019-06-15 10:07:22,697 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-6
2019-06-15 10:07:22,766 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-7
2019-06-15 10:07:22,793 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-7
2019-06-15 10:07:22,793 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-7
2019-06-15 10:07:22,866 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-8
2019-06-15 10:07:22,896 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-8
2019-06-15 10:07:22,897 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-8
2019-06-15 10:07:22,966 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-9
2019-06-15 10:07:22,999 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-9
2019-06-15 10:07:22,999 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-9
2019-06-15 10:07:23,066 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-10
2019-06-15 10:07:23,098 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-10
2019-06-15 10:07:23,098 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-10
2019-06-15 10:07:23,098 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2019-06-15 10:07:23,098 INFO o.a.j.s.FileServer: Close: /Users/jahidul/IdeaProjects/B1901_JMeter/JmeterData.csv
2019-06-15 10:07:23,099 INFO o.a.j.r.Summariser: summary =     20 in 00:00:01 =   16.7/s Avg:    18 Min:     5 Max:    70 Err:     0 (0.00%)
2019-06-15 10:07:23,099 INFO o.a.j.JMeter: Generating Dashboard
2019-06-15 10:07:23,099 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2019-06-15 10:07:23,108 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2019-06-15 10:07:23,164 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2019-06-15 10:07:23,164 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2019-06-15 10:07:23,166 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2019-06-15 10:07:23,166 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2019-06-15 10:07:23,170 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2019-06-15 10:07:23,173 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2019-06-15 10:07:23,174 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2019-06-15 10:07:23,174 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2019-06-15 10:07:23,181 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2019-06-15 10:07:23,182 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2019-06-15 10:07:23,182 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2019-06-15 10:07:23,182 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2019-06-15 10:07:23,185 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2019-06-15 10:07:23,185 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 140 samples
2019-06-15 10:07:23,185 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2019-06-15 10:07:23,186 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2019-06-15 10:07:23,186 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2019-06-15 10:07:23,186 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2019-06-15 10:07:23,186 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2019-06-15 10:07:23,186 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2019-06-15 10:07:23,187 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2019-06-15 10:07:23,187 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2019-06-15 10:07:23,187 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2019-06-15 10:07:23,187 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2019-06-15 10:07:23,187 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 300 samples
2019-06-15 10:07:23,187 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 60 samples
2019-06-15 10:07:23,187 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 20 samples
2019-06-15 10:07:23,188 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 20 samples produced in 56ms on channel 0
2019-06-15 10:07:23,188 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2019-06-15 10:07:23,190 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /Users/jahidul/IdeaProjects/B1901_JMeter/results
2019-06-15 10:07:23,257 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /Users/jahidul/IdeaProjects/B1901_JMeter/results, creating folder structure
2019-06-15 10:07:23,555 INFO o.a.j.JMeter: Dashboard generated